In [1]:
import pandas as pd
df = pd.read_csv(r'C:\Users\hayong\Downloads\world_cities.csv')
df

     Unnamed: 0 City / Urban area     Country  Population  Land area (in sqKm)
0             0      Buenos Aires   Argentina    11200000                 2266
1             1         Melbourne   Australia     3162000                 2080
2             2            Sydney   Australia     3502000                 1687
3             3          Brisbane   Australia     1508000                 1603
4             4             Perth   Australia     1177000                  964
..          ...               ...         ...         ...                  ...
244         245            Canton         USA      267000                  372
245         246           Spokane         USA      335000                  371
246         247          Tashkent  Uzbekistan     2200000                  531
247         248  Ho Chi Minh City     Vietnam     4900000                  518
248         249            Harare    Zimbabwe     1750000                  712

[249 rows x 5 columns]

In [3]:
df[['City / Urban area', 'Country']].describe()

       City / Urban area Country
count                249     249
unique               249      61
top             Tel Aviv     USA
freq                   1     105

In [15]:
df.loc[df["Population"] / df["Land area (in sqKm)"] > 10000]
# 이렇게 하면 하나씩 다 세야되구요

,Unnamed: 0,City / Urban area,Country,Population,Land area (in sqKm)
32,32,Beijing,China,8614000,748
33,33,Shanghai,China,10000000,746
34,34,Shenzhen,China,8000000,466
36,36,Tianjin,China,4750000,453
38,38,Bogota,Colombia,7000000,518
39,39,Kinshasa,Congo,5000000,469
71,71,Delhi,India,14300000,1295
73,73,Bangalore,India,5400000,534
74,74,Kolkata,India,12700000,531
75,75,Mumbai,India,14350000,484
76,76,Chennai,India,5950000,414
77,77,Jakarta,Indonesia,14250000,1360
78,78,Tehran,Iran,7250000,686
99,99,Lagos,Nigeria,13400000,738
101,101,Karachi,Pakistan,9800000,518
102,102,Lima,Peru,7000000,596
103,103,Manila,Philippines,14750000,1399
123,123,Seoul/Incheon,South Korea,17500000,1049
129,129,Taipei,Taiwan,5700000,376

In [16]:
df["Density"] = df["Population"] / df["Land area (in sqKm)"]

In [17]:
df_high_density = df[df["Density"] > 10000]

In [18]:
df_high_density .info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19 entries, 32 to 129
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           19 non-null     int64
 1   City / Urban area    19 non-null     object
 2   Country              19 non-null     object
 3   Population           19 non-null     int64
 4   Land area (in sqKm)  19 non-null     int64
 5   Density              19 non-null     float64
dtypes: float64(1), int64(3), object(2)
memory usage: 1.0+ KB

In [23]:
df["Density"] = df["Population"] / df["Land area (in sqKm)"]
df

,Unnamed: 0,City / Urban area,Country,Population,Land area (in sqKm),Density
0,0,Buenos Aires,Argentina,11200000,2266,4942.630185
1,1,Melbourne,Australia,3162000,2080,1520.192308
2,2,Sydney,Australia,3502000,1687,2075.874333
3,3,Brisbane,Australia,1508000,1603,940.736120
4,4,Perth,Australia,1177000,964,1220.954357
...,...,...,...,...,...,...
244,245,Canton,USA,267000,372,717.741935
245,246,Spokane,USA,335000,371,902.964960
246,247,Tashkent,Uzbekistan,2200000,531,4143.126177
247,248,Ho Chi Minh City,Vietnam,4900000,518,9459.459459
248,249,Harare,Zimbabwe,1750000,712,2457.865169

In [24]:
df.sort_values(by='Density', ascending=False)

,Unnamed: 0,City / Urban area,Country,Population,Land area (in sqKm),Density
75,75,Mumbai,India,14350000,484,29648.760331
74,74,Kolkata,India,12700000,531,23917.137476
101,101,Karachi,Pakistan,9800000,518,18918.918919
99,99,Lagos,Nigeria,13400000,738,18157.181572
34,34,Shenzhen,China,8000000,466,17167.381974
...,...,...,...,...,...,...
194,195,Chattanooga,USA,344000,751,458.055925
223,224,Asheville,USA,222000,536,414.179104
57,57,Pau,France,181000,450,402.222222
220,221,Hickory,USA,188000,546,344.322344
196,197,Barnstable Town,USA,244000,741,329.284750